#include <linux/config.h>
#include <linux/module.h>
#include <linux/kernel.h>
#include <linux/init.h>
#include <linux/ioport.h>
#include <linux/delay.h>
#include <asm/hardware.h>
#include <asm/io.h>


#ifdef CONFIG_RTL8366SR_PHY
#undef VITESSE_G5SWITCH
#else
#define VITESSE_G5SWITCH	1
#endif

#ifdef VITESSE_G5SWITCH	

#define GMAC_GLOBAL_BASE_ADDR       (IO_ADDRESS(SL2312_GLOBAL_BASE))
#define GPIO_BASE_ADDR1  (IO_ADDRESS(SL2312_GPIO_BASE1))
enum GPIO_REG
{
    GPIO_DATA_OUT   = 0x00,
    GPIO_DATA_IN    = 0x04,
    GPIO_PIN_DIR    = 0x08,
    GPIO_BY_PASS    = 0x0c,
    GPIO_DATA_SET   = 0x10,
    GPIO_DATA_CLEAR = 0x14,
};

#define GMAC_SPEED_10			0
#define GMAC_SPEED_100			1
#define GMAC_SPEED_1000			2
enum phy_state
{
    LINK_DOWN   = 0,
    LINK_UP     = 1
};

#ifndef BIT
#define BIT(x)						(1 << (x))
#endif

//int Get_Set_port_status();
unsigned int SPI_read_bit(void);
void SPI_write_bit(char bit_EEDO);
void SPI_write(unsigned char block,unsigned char subblock,unsigned char addr,unsigned int value);
unsigned int SPI_read(unsigned char block,unsigned char subblock,unsigned char addr);
int SPI_default(void);
void SPI_CS_enable(unsigned char enable);
unsigned int SPI_get_identifier(void);
void phy_write(unsigned char port_no,unsigned char reg,unsigned int val);
unsigned int phy_read(unsigned char port_no,unsigned char reg);
void phy_write_masked(unsigned char port_no,unsigned char reg,unsigned int val,unsigned int mask);
void init_seq_7385(unsigned char port_no) ;
void phy_receiver_init (unsigned char port_no);

#define PORT_NO		4
int switch_pre_speed[PORT_NO]={0,0,0,0};
int switch_pre_link[PORT_NO]={0,0,0,0};
#define PORT_NO_c		5
int switch_pre_speed_c[PORT_NO_c]={0,0,0,0,0};
int switch_pre_link_c[PORT_NO_c]={0,0,0,0,0};
extern int c_GPIO;

#define SWITCH_MIB_COUNTERS_MAX		30
#define SWITCH_MIB_REG_NUM			3
int switch_showing_flag;
int switch_reset_flag;

typedef struct {
		unsigned long	rx_bytes;
		unsigned long	rx_all_pkts;		// 0
		unsigned long	rx_bmcast_pkts;		// 1
		unsigned long   rx_error_pkts;		// 2
		unsigned long	rx_bcast_pkts;		// 3
		unsigned long	rx_mcast_pkts;		// 4
		unsigned long	rx_64_pkts;			// 5
		unsigned long	rx_65_pkts;			// 6
		unsigned long	rx_128_pkts;		// 7
		unsigned long	rx_256_pkts;		// 8
		unsigned long	rx_512_pkts;		// 9
		unsigned long	rx_1024_pkts;		// 10
		unsigned long	rx_jumbo_pkts;		// 11
		unsigned long	rx_pause_pkts;		// 12
		unsigned long	rx_fifo_drop_pkts;	// 13
		unsigned long	rx_backward_drop_pkts;		// 14
		unsigned long	rx_classifier_drop_pkts;	// 15
		unsigned long	rx_crc_pkts;				// 16
		unsigned long	rx_under_size_pkts;			// 17
		unsigned long	rx_over_size_pkts;			// 18
		unsigned long	rx_fragment_pkts;			// 19
		unsigned long	rx_jabber_pkts;				// 20
		unsigned long	rx_control_pkts;			// 21
		unsigned long	rx_reserved_pkts[3];		// 22, 23, 24
		unsigned long	rx_good_pkts;				// 25
		unsigned long	rx_class_pkts[4];			// 26, 37, 28, 29
} SWITCH_RX_STATISTICS_T;

typedef struct {
		unsigned long	tx_bytes;
		unsigned long	tx_all_pkts;		// 0
		unsigned long	tx_bmcast_pkts;		// 1
		unsigned long   tx_error_pkts;		// 2
		unsigned long	tx_bcast_pkts;		// 3
		unsigned long	tx_mcast_pkts;		// 4
		unsigned long	tx_64_pkts;			// 5
		unsigned long	tx_65_pkts;			// 6
		unsigned long	tx_128_pkts;		// 7
		unsigned long	tx_256_pkts;		// 8
		unsigned long	tx_512_pkts;		// 9
		unsigned long	tx_1024_pkts;		// 10
		unsigned long	tx_jumbo_pkts;		// 11
		unsigned long	tx_pause_pkts;		// 12
		unsigned long	tx_fifo_drop_pkts;	// 13
		unsigned long	tx_drop_pkts;		// 14
		unsigned long	tx_classifier_drop_pkts;	// 15
		unsigned long	tx_cfi_drop_pkts;			// 16
		unsigned long	tx_reserved_pkts[8];		// 17, 18, 19, 20, 21, 22, 23, 24
		unsigned long	tx_good_pkts;				// 25
		unsigned long	tx_class_pkts[4];			// 26, 27, 28, 29
} SWITCH_TX_STATISTICS_T;

const char *stat_rx_msg[]=
{
	"Rx All Packets      ",		// 0 
	"Rx Broadcast/Multi  ",     // 1 
	"Rx Errors           ",     // 2 
	"Rx Broadcast        ",     // 3 
	"Rx Multicast        ",     // 4 
	"Rx 64 Bytes         ",     // 5 
	"Rx 65-127 Bytes     ",     // 6 
	"Rx 128-255 Bytes    ",     // 7 
	"Rx 256-511 Bytes    ",     // 8 
	"Rx 512-1023 Bytes   ",     // 9 
	"Rx 1024-1526 Bytes  ",     // 10
	"Rx Jumbo Frames     ",     // 11
	"Rx Pause Frames     ",     // 12
	"Rx Fifo Drop        ",     // 13
	"Rx Backward Drop    ",		// 14
	"Rx Classifier Drop  ",     // 15
	"Rx CRC Errors       ",     // 16
	"Rx Under Size       ",     // 17
	"Rx Over Size        ",     // 18
	"Rx Fragments        ",     // 19
	"Rx jabbers          ",     // 20
	"Rx Control Pkts     ",     // 21
	"Rx Reserved-1       ",     // 22
	"Rx Reserved-2       ",		// 23
	"Rx Reserved-3       ",		// 24
